In [1]:
import pandas as pd # type: ignore

df=pd.read_csv("Biodata.csv")
print(df)

       Name  Gender     Mobile    Id   Address  Nationality
0     suraj    male     545454    11  srinagar       indian
1     reeni  female     565656    22       dun     pakistan
2    prachi  female      98995    33    mumbai    shrilanka
3     komal  female      84845    44     bihar           uk
4  ashirwad    male     124484    55     patna       landon
5     raman    male  215456456    66  bangluru       africa
6       ram    male    4548415    77   kolkata       canada
7     rohit    male     848612    88   chennai  afganishtan
8     megha  female     848481    99        up    newziland
9    kavita  female   24848421  1010    gujrat   australiya

In [ ]:
df.index #you can get the index values

RangeIndex(start=0, stop=10, step=1)

In [ ]:
df.columns #you can get the column value

Index(['Name', 'Gender', 'Mobile', 'Id', 'Address', 'Nationality'], dtype='object')

In [ ]:
df.describe() # work only with neumerical  values

             Mobile           Id
count  1.000000e+01    10.000000
mean   2.479698e+07   150.500000
std    6.742305e+07   303.330128
min    8.484500e+04    11.000000
25%    2.297265e+05    35.750000
50%    7.070685e+05    60.500000
75%    3.623464e+06    85.250000
max    2.154565e+08  1010.000000

In [8]:
df.head(2) #get 2 value from header

    Name  Gender  Mobile  Id   Address Nationality
0  suraj    male  545454  11  srinagar      indian
1  reeni  female  565656  22       dun    pakistan

In [9]:
df.tail(2) #get 2 values from tail

     Name  Gender    Mobile    Id Address Nationality
8   megha  female    848481    99      up   newziland
9  kavita  female  24848421  1010  gujrat  australiya

In [ ]:
df[0:3] #slicing

     Name  Gender  Mobile  Id   Address Nationality
0   suraj    male  545454  11  srinagar      indian
1   reeni  female  565656  22       dun    pakistan
2  prachi  female   98995  33    mumbai   shrilanka

In [11]:
df.index.array

<NumpyExtensionArray>
[np.int64(0), np.int64(1), np.int64(2), np.int64(3), np.int64(4), np.int64(5),
 np.int64(6), np.int64(7), np.int64(8), np.int64(9)]
Length: 10, dtype: int64

In [12]:
df.drop("Gender",axis=1)

       Name     Mobile    Id   Address  Nationality
0     suraj     545454    11  srinagar       indian
1     reeni     565656    22       dun     pakistan
2    prachi      98995    33    mumbai    shrilanka
3     komal      84845    44     bihar           uk
4  ashirwad     124484    55     patna       landon
5     raman  215456456    66  bangluru       africa
6       ram    4548415    77   kolkata       canada
7     rohit     848612    88   chennai  afganishtan
8     megha     848481    99        up    newziland
9    kavita   24848421  1010    gujrat   australiya